Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudtrail_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudtrail_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSCloudTrailAclCheck"

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSCloudTrailWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyUnencryptedObjectUploads"

          + condition {
              + test     = "StringNotEquals"
              + values   = [
                  + "AES256",
                ]
              + variable = "s3:x-amz-server-side-encryption"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyIfNotFromOurOrg"

          + condition {
              + test     = "StringNotEquals"
              + values   = [
                  + "o-4uer5s3xlw",
                ]
              + variable = "aws:PrincipalOrgID"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudtrail.media_trail will be created
+ resource "aws_cloudtrail" "media_trail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "wutopia-media-trail"
      + region                        = "us-east-2"
      + s3_bucket_name                = (known after apply)
      + sns_topic_arn                 = (known after apply)
      + tags_all                      = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }

      + advanced_event_selector {
          + name = "S3WriteEventsForMedia"

          + field_selector {
              + ends_with       = []
              + equals          = [
                  + "AWS::S3::Object",
                ]
              + field           = "resources.type"
              + not_ends_with   = []
              + not_equals      = []
              + not_starts_with = []
              + starts_with     = []
            }
          + field_selector {
              + ends_with       = []
              + equals          = [
                  + "Data",
                ]
              + field           = "eventCategory"
              + not_ends_with   = []
              + not_equals      = []
              + not_starts_with = []
              + starts_with     = []
            }
          + field_selector {
              + ends_with       = []
              + equals          = [
                  + "false",
                ]
              + field           = "readOnly"
              + not_ends_with   = []
              + not_equals      = []
              + not_starts_with = []
              + starts_with     = []
            }
          + field_selector {
              + ends_with       = []
              + equals          = []
              + field           = "resources.ARN"
              + not_ends_with   = []
              + not_equals      = []
              + not_starts_with = []
              + starts_with     = [
                  + "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/",
                ]
            }
        }
    }

  # aws_cloudwatch_event_rule.s3_raw_puts will be created
+ resource "aws_cloudwatch_event_rule" "s3_raw_puts" {
      + arn            = (known after apply)
      + description    = "S3 Object Created events for prod-wrestleutopia-media-bucket with key prefix raw/"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + bucket = {
                      + name = [
                          + "prod-wrestleutopia-media-bucket",
                        ]
                    }
                  + object = {
                      + key = [
                          + {
                              + prefix = "raw/"
                            },
                        ]
                    }
                }
              + detail-type = [
                  + "Object Created",
                ]
              + source      = [
                  + "aws.s3",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "wutopia-s3-raw-puts"
      + name_prefix    = (known after apply)
      + region         = "us-east-2"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_event_target.imgproc will be created
+ resource "aws_cloudwatch_event_target" "imgproc" {
      + arn            = "arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-image-processor"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-2"
      + rule           = "wutopia-s3-raw-puts"
      + target_id      = "lambda-imgproc"
    }

  # aws_iam_policy.s3_full_policy will be destroyed
  # (because aws_iam_policy.s3_full_policy is not in configuration)
- resource "aws_iam_policy" "s3_full_policy" {
      - arn              = "arn:aws:iam::390402544450:policy/wrestleutopia_s3_full_policy" -> null
      - attachment_count = 0 -> null
      - description      = "Policy to allow Lambda full access to S3" -> null
      - id               = "arn:aws:iam::390402544450:policy/wrestleutopia_s3_full_policy" -> null
      - name             = "wrestleutopia_s3_full_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket",
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAVVZOOCNBCQOOVDOGB" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.image_processor will be updated in-place
~ resource "aws_lambda_function" "image_processor" {
        id                             = "wrestleutopia-image-processor"
      ~ last_modified                  = "2025-09-24T03:37:39.000+0000" -> (known after apply)
      ~ reserved_concurrent_executions = -1 -> 10
      ~ source_code_hash               = "Gd0+PSfwTADYT0OrVHkjGL1tRMnHuo9pzeo7COA0f4Y=" -> "nL2O/U14mS/XjUbffUsKU9c0x5LmLw1v7gTiYy+906c="
        tags                           = {}
      ~ timeout                        = 60 -> 120
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "MEDIA_BUCKET" = "prod-wrestleutopia-media-bucket" -> null
                # (2 unchanged elements hidden)
            }
        }

      ~ ephemeral_storage {
          ~ size = 512 -> 1024
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_eventbridge will be created
+ resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-image-processor"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.s3_invoke_imgproc will be destroyed
  # (because aws_lambda_permission.s3_invoke_imgproc is not in configuration)
- resource "aws_lambda_permission" "s3_invoke_imgproc" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "wrestleutopia-image-processor" -> null
      - id                  = "AllowS3InvokeImgProc" -> null
      - principal           = "s3.amazonaws.com" -> null
      - region              = "us-east-2" -> null
      - source_arn          = "arn:aws:s3:::prod-wrestleutopia-media-bucket" -> null
      - statement_id        = "AllowS3InvokeImgProc" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket.cloudtrail_logs will be created
+ resource "aws_s3_bucket" "cloudtrail_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_cors_configuration.media will be updated in-place
~ resource "aws_s3_bucket_cors_configuration" "media" {
        id                    = "prod-wrestleutopia-media-bucket"
        # (3 unchanged attributes hidden)

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "POST",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "https://www.wrestleutopia.com",
            ] -> null
          - expose_headers  = [
              - "Content-Type",
              - "ETag",
            ] -> null
            id              = null
          - max_age_seconds = 3000 -> null
        }
      + cors_rule {
          + allowed_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://www.wrestleutopia.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 600
        }
    }

  # aws_s3_bucket_lifecycle_configuration.cloudtrail_logs will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "cloudtrail_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "trail-compliance-7y"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2555
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "AWSLogs/"
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be updated in-place
~ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
        id                                     = "prod-wrestleutopia-media-bucket"
        # (4 unchanged attributes hidden)

      ~ rule {
            id     = "delete_posts_after_1_week"
            # (2 unchanged attributes hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }

            # (2 unchanged blocks hidden)
        }
      + rule {
          + id     = "gallery_intelligent_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "gallery/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
    }

  # aws_s3_bucket_notification.media_notifications will be updated in-place
~ resource "aws_s3_bucket_notification" "media_notifications" {
      ~ eventbridge = false -> true
        id          = "prod-wrestleutopia-media-bucket"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - filter_prefix       = "raw/" -> null
          - id                  = "tf-s3-lambda-20250923201336892000000002" -> null
          - lambda_function_arn = "arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-image-processor" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_ownership_controls.cloudtrail_logs will be created
+ resource "aws_s3_bucket_ownership_controls" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.cloudtrail_logs will be created
+ resource "aws_s3_bucket_policy" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.cloudtrail_logs will be created
+ resource "aws_s3_bucket_public_access_block" "cloudtrail_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.cloudtrail_logs will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # random_id.trail will be created
+ resource "random_id" "trail" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 11 to add, 6 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 11 to add, 6 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```